In [2]:
import pandas
print(pandas.__version__)

1.0.1

In [6]:
import numpy as np
import pandas as pd

In [45]:
#Series
data = pd.Series([0.25,0.5,0.75,1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [10]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [16]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [28]:
data[1]

0.5

In [27]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [32]:
data = pd.Series([0.25,0.5,0.75,1.0], index=['a','b','c','d'] )
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [34]:
data['c']

0.75

In [85]:
data = pd.Series([3,2,'5',7.0,"king"], index=[3,4,4,4,0] )
data

3       3
4       2
4       5
4       7
0    king
dtype: object

In [86]:
#Dictionary
states_populationUSA_dict={
    'Texas':12121212122,
    "New York":32323989877,
    'Florida':888732654
}
population=pd.Series(states_populationUSA_dict)
population

Texas       12121212122
New York    32323989877
Florida       888732654
dtype: int64

In [42]:
population['New York']

32323989877

In [46]:
population['Texas':'New York']

Texas       12121212122
New York    32323989877
dtype: int64

In [59]:
#Data Frame
states_populationUSA_dict={
    'Texas':43434,
    "New York":75454,
    'Florida':21233
}
area = pd.Series(states_populationUSA_dict)
area

Texas       43434
New York    75454
Florida     21233
dtype: int64

In [61]:
states = pd.DataFrame({'population':population,
                      'area':area})
states

           population   area
Texas     12121212122  43434
New York  32323989877  75454
Florida     888732654  21233

In [69]:
states.index

Index(['Texas', 'New York', 'Florida'], dtype='object')

In [68]:
states.columns

Index(['population', 'area'], dtype='object')

In [87]:
#Index
ind = pd.Index([3,4,2,1,4,5,3,6])
ind

Int64Index([3, 4, 2, 1, 4, 5, 3, 6], dtype='int64')

In [74]:
ind[6]

3

In [80]:
ind[::2]

Int64Index([3, 2, 4, 3], dtype='int64')

In [83]:
ind.size,ind.shape,ind.ndim,ind.dtype

(8, (8,), 1, dtype('int64'))

In [89]:
#Data indexing and selection
#Data selection in series

data = pd.Series([0.25,0.5,0.75,1.0], index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [90]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [94]:
#slicing by explicit index
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [92]:
#slicing by implicit integer index
data[0:2]

a    0.25
b    0.50
dtype: float64

In [93]:
data[['a','e']]

a    0.25
e    1.25
dtype: float64

In [99]:
#loc and iloc
data=pd.Series(['a','b','c'], index=[1,2,3])
data

1    a
2    b
3    c
dtype: object

In [103]:
# loc explicit index
data.loc[1]

'a'

In [101]:
data.loc[1:3]

1    a
2    b
3    c
dtype: object

In [104]:
data.iloc[1]

'b'

In [105]:
data.iloc[1:3]

2    b
3    c
dtype: object

In [117]:
arae = pd.Series({
    'Texas':43434,
    "New York":75454,
    'Florida':21233
})
pop = pd.Series({
    'Texas':434211234,
    "New York":721245454,
    'Florida':212645633
})
data = pd.DataFrame({'area':area,"pop":pop})
data

           area        pop
Texas     43434  434211234
New York  75454  721245454
Florida   21233  212645633

In [111]:
data.area
data['area']

Texas       43434
New York    75454
Florida     21233
Name: area, dtype: int64

In [118]:
data['density']=data['pop'] / data['area']
data

           area        pop       density
Texas     43434  434211234   9997.035364
New York  75454  721245454   9558.743791
Florida   21233  212645633  10014.865210

In [119]:
data.values

array([[4.34340000e+04, 4.34211234e+08, 9.99703536e+03],
       [7.54540000e+04, 7.21245454e+08, 9.55874379e+03],
       [2.12330000e+04, 2.12645633e+08, 1.00148652e+04]])

In [121]:
data.iloc[:2,:3]

           area        pop      density
Texas     43434  434211234  9997.035364
New York  75454  721245454  9558.743791

In [130]:
data.loc[:'New York',:'pop']

           area        pop
Texas     43434  434211234
New York  75454  721245454

In [134]:
data[data.density >10000]

          area        pop      density
Florida  21233  212645633  10014.86521

In [140]:
#Handling missing values
data = pd.Series([1,np.nan,2,'hello',None])

In [153]:
data.isnull()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [152]:
data[data.isnull()]

1     NaN
4    None
dtype: object

In [154]:
data[data.notnull()]

0        1
2        2
3    hello
dtype: object

In [155]:
data.dropna()

0        1
2        2
3    hello
dtype: object

In [160]:
df =pd.DataFrame([[1,np.nan,2],
              [2,3,5],
              [np.nan,4,6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [163]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [168]:
df.dropna(axis=0)

     0    1  2
1  2.0  3.0  5

In [167]:
df.dropna(axis=1)

   2
0  2
1  5
2  6

In [170]:
df[3]=np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [171]:
df.dropna(axis='columns',how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [177]:
#Filling null values
data =pd.Series([1,np.nan,2,None,3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [186]:
data.fillna(9)

a    1.0
b    9.0
c    2.0
d    9.0
e    3.0
dtype: float64

In [187]:
#forward-fill
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [189]:
#back-fill
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [190]:
df

     0    1   2   3
0  1.0  NaN NaN NaN
1  2.0  3.0 NaN NaN
2  NaN  4.0 NaN NaN

In [196]:
df.fillna(method='ffill',axis=0)

     0    1   2   3
0  1.0  NaN NaN NaN
1  2.0  3.0 NaN NaN
2  2.0  4.0 NaN NaN

In [197]:
df.fillna(method='ffill',axis=1)

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  2.0  3.0  3.0  3.0
2  NaN  4.0  4.0  4.0

In [208]:
#pandas string operations
data=['hakk','abul','jerina','SHAik']
[s.capitalize() for s in data]

['Hakk', 'Abul', 'Jerina', 'Shaik']

In [209]:
names = pd.Series(data)
names

0      hakk
1      abul
2    jerina
3     SHAik
dtype: object

In [210]:
#concat and append
ser1 = pd.Series(['A','B',"C"],index=[1,2,3])
ser2 = pd.Series(['D','E',"F"],index=[4,5,6])
pd.concat([ser1,ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [211]:
pwd

'C:\\Users\\Administrator.LAPTOP-OBS-47'

In [212]:
df

     0    1   2   3
0  1.0  NaN NaN NaN
1  2.0  3.0 NaN NaN
2  NaN  4.0 NaN NaN

In [217]:
a = df.to_csv('asasa.csv')
a